Revit 2027 API
ParameterTypeId.SteelElemPatternTotalWidth Property
 "Length on side 2"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemPatternTotalWidth { get; }
Public Shared ReadOnly Property SteelElemPatternTotalWidth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemPatternTotalWidth {
	ForgeTypeId^ get ();
}
static member SteelElemPatternTotalWidth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace